Autodesk.Revit.UI.Macros.UIMacroManager.StepInto(Autodesk.Revit.DB.Macros.Macro)
Step into the macro in sharp develop.
macro:
The macro.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throw when the module is unloaded, or it is a Ruby or Python script.
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager.EditModule(Autodesk.Revit.DB.Macros.MacroModule)
Edits the macro in sharp develop.
module:
The macro module.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager.EditMacro(Autodesk.Revit.DB.Macros.Macro)
Edits the macro in sharp develop.
macro:
The macro.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager.RemoveModule(Autodesk.Revit.DB.Macros.MacroModule)
Removes a MacroModule from the application or document.
Remarks:
Note: document-level modules will not be removed to the document until the document is saved.
Thus this operation is not undoable and does not require an open transaction even for document-level modules.
module:
The module will be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager.AddModule(Autodesk.Revit.DB.Macros.ModuleSettings,Autodesk.Revit.DB.Macros.MacroEnvironment)
Adds a MacroModule to the application or document.
Remarks:
Note: document-level modules will not be saved to the document until the document is saved.
Thus this operation is not undoable and does not require an open transaction even for document-level modules.
moduleSettings:
The module settings.
environment:
The module environment.
Returns:
The new module.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the module name is duplicated with the existing one,
or the name is too long, or the name contains invalid identifier(s),
such as include "#", "%", ... and key words in C# or VB.NET.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014